tests/tests/nginx-LT-1-5_reports_2022-09-03_1629/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 27,
    "errorCount" : 17,
    "errorPct" : 62.962963,
    "meanResTime" : 10.407407407407405,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 78.0,
    "pct1ResTime" : 26.999999999999993,
    "pct2ResTime" : 60.79999999999991,
    "pct3ResTime" : 78.0,
    "throughput" : 0.8202946984657451,
    "receivedKBytesPerSec" : 0.26696367537596843,
    "sentKBytesPerSec" : 0.1906544318699681
  },
  "MyGP Prod Balance" : {
    "transaction" : "MyGP Prod Balance",
    "sampleCount" : 27,
    "errorCount" : 17,
    "errorPct" : 62.962963,
    "meanResTime" : 10.407407407407405,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 78.0,
    "pct1ResTime" : 26.999999999999993,
    "pct2ResTime" : 60.79999999999991,
    "pct3ResTime" : 78.0,
    "throughput" : 0.8202946984657451,
    "receivedKBytesPerSec" : 0.26696367537596843,
    "sentKBytesPerSec" : 0.1906544318699681
  }
}